name = 'Вася'
print('Здесь был', name)



























#  Приветствие миру — традиционная первая строка в освоении нового языка,
# но что-то пошло не так.
# Ниже написан вызов функции print() с аргументом 'Роботы скоро захватят мир!'
# Замените "захватят" на "спасут",
# программа станет дружелюбнее!
# print('Роботы скоро захватят мир!')

# print('Я твоя программа, мне тут нравится! 👾')




























Задача 1
Чтобы Вася стал более дружелюбным, научите его рассказывать о себе. 
Для начала пусть он представится — напечатает на экране фразу: Привет, я Вася! Я умею работать с переменными!.
Присвойте переменной message значение — строку Привет, я Вася! Я умею работать с переменными!. Затем напечатайте переменную message.
Код

# Вместо многоточия подставьте текст сообщения.
#message = ...

# Вместо многоточия подставьте имя переменной, в которой хранится текст сообщения.
# print(...)




























# Каждый вечер библиофил Архип закрывает книгу и записывает в переменную pages номер последней прочитанной страницы.
# pages = 10  # В первый вечер.
# pages = 25  # Во второй вечер.
# pages = 50  # В третий вечер.
# pages = 80  # В четвёртый вечер.

# А на пятый день Архип решил напечатать значение переменной pages:
# print(pages)
# Что будет напечатано?


























# num_as_string = '100499'  # Значение этой переменной — строка.
# num_as_num = 1  # Значение этой переменной — число.

# Попробуем сложить и напечатать:
# print(num_as_string + num_as_num)




























# one_hundred = 100
# five_hundred = '500'
# print('В ответе можно получить 600, а можно и 100500!')
# print(one_hundred + five_hundred)
# print('Вот мы и получили 600')







# print(one_hundred + int(five_hundred))
# Эту же задачу можно решить иначе:
# если записать значение переменной one_hundred в виде строки — one_hundred = '100',
# то в коде будут складываться две строки и результатом работы программы будет строка '100500'.





























# snake = '38.2'  # Длина Питона в попугаях
# length = 6.5  # Количество Питонов, которых можно уложить вдоль вагона.

# Напишите формулу для вычисления количества попугаев
# result = ...

# print('В вагоне можно положить в ряд', result, 'попугаев')









# snake = '38.2'  # Длина Питона в попугаях
# length = 6.5  # Количество Питонов, которых можно уложить вдоль вагона.

# Напишите формулу для вычисления количества попугаев
# result = length * float(snake)

# print('В вагоне можно положить в ряд', int(result), 'попугаев')