# bremen_musicians = ['Кот', 'Пёс', 'Трубадур', 'Осёл', 'Петух']

# for musician in bremen_musicians:
    # Каждый элемент списка bremen_musicians 
    # по очереди будет передан в переменную musician
    # и напечатан
#    print(musician)

# Здесь может быть какой-то код, который выполнится
# только после того, как цикл закончит работу





























#months = ['Январь', 'Февраль', 'Март', 'Апрель', 'Май', 'Июнь', 'Июль', 'Август', 'Сентябрь', 'Октябрь', 'Ноябрь', 'Декабрь']

#for month in ...:
#    print(...)































# pigs = ['Ниф-Ниф', 'Наф-Наф', 'Нуф-Нуф']
# print('Дорогие свиньи!')

# for ...
#    ...

#print('приглашаю вас на ужин!')
#print('Любящий вас Волк.')










#pigs = ['Ниф-Ниф', 'Наф-Наф', 'Нуф-Нуф']
#print('Дорогие свиньи!')

#for pig in pigs:
#    print(pig)

#print('приглашаю вас на ужин!')
#print('Любящий вас Волк.')






























#numbers = [1, 2, 3]
#for number in numbers:
#    print('Печатаем элемент списка')
#    print(number)












#numbers = [1, 2, 3]
#for number in numbers:
#    print('Печатаем элемент списка')
#print(number)































#numbers = ['Раз', 'Два', 'Три', 'Четыре', 'Пять']
#for number in numbers:
#    print(number)
#print('Вышел зайчик погулять') добавить отступ




























#kids = ['Витя', 'Маша', 'Марина']
#sweets = ['Батончик', 'Сникерс', 'Мишка Косолапый', 'Коровка']

#for kid in kids:
#for sweet in sweets:  # Внесите изменения в строку.
#print(kid, 'получает конфету', sweet)  # Внесите изменения в строку.











#kids = ['Витя', 'Маша', 'Марина']
#sweets = ['Батончик', 'Сникерс', 'Мишка Косолапый', 'Коровка']

#for kid in kids:
#    for sweet in sweets:  # Внесите изменения в строку.
#        print(kid, 'получает конфету', sweet)  # Внесите изменения в строку.














#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include <string.h>
#include <unistd.h>
             k;double sin()
         ,cos();main(){float A=
       0,B=0,i,j,z[1760];char b[
     1760];printf("\x1b[2J");for(;;
  ){memset(b,32,1760);memset(z,0,7040)
  ;for(j=0;6.28>j;j+=0.07)for(i=0;6.28
 >i;i+=0.02){float c=sin(i),d=cos(j),e=
 sin(A),f=sin(j),g=cos(A),h=d+2,D=1/(c*
 h*e+f*g+5),l=cos      (i),m=cos(B),n=
sin(B),t=c*h*g-f*        e;int x=40+30*D*
(l*h*m-t*n),y=            12+15*D*(l*h*n
+t*m),o=x+80*y,          N=8*((f*e-c*d*g
 )*m-c*d*e-f*g-l        *d*n);if(22>y&&
 y>0&&x>0&&80>x&&D>z[o]){z[o]=D;;;b[o]=
 ".,-~:;=!*#$@"[N>0?N:0];}}/*#****!!-*/
  printf("\x1b[H");for(k=0;1761>k;k++)
   putchar(k%80?b[k]:10);A+=0.04;B+=
     0.02;}}/*****####*******!!=;:~
       ~::==!!!**********!!!==::-
         .,~~;;;========;;;:~-.
             ..,--------,*/












"""
    Детям надоело декламировать эту считалку. «Пусть работает Python!», решили они — и написали код.
    Но в коде они наделали ошибок. Исправьте код, чтобы он заработал.
    Считалку нужно повторить для каждого ребёнка и в конце напечатать его имя.
    Когда в цикле будут перебраны все имена, должна быть напечатана строка «Всё!».
    После каждого круга и перед строкой «Всё!» должна быть пустая строка, поэтому не удаляйте вызов print(), в котором нет аргументов.
    Обращайте внимание на сообщения об ошибках; IndentationError: unindent does not match any outer indentation level означает,
    что в коде установлено неправильное количество пробелов; в сообщении показана строка, до или после которой впервые встретилась ошибка. 
"""
#kids = ['Витя', 'Маша', 'Марина']
#for kid in kids:
#      print ('У Литейного моста')
# print('Я поймал в Неве кита,')
#            print('Спрятал за окошко.')
#  print('Съела его кошка,')
#     print('Помогали два кота…')
#        print('Вот и нет теперь кита!')
#  print('Ты не веришь другу?')
#               print('Выходи из круга!')
#print('* Из круга выходит', kid, '*')
#                      print()
#    print('Всё!')













#kids = ['Витя', 'Маша', 'Марина']
#for kid in kids:
#    print ('У Литейного моста')
#    print('Я поймал в Неве кита,')
#    print('Спрятал за окошко.')
#    print('Съела его кошка,')
#    print('Помогали два кота…')
#    print('Вот и нет теперь кита!')
#    print('Ты не веришь другу?')
#    print('Выходи из круга!')
#    print('* Из круга выходит', kid, '*')
#    print()
#print('Всё!')



















Напечатайте таблицу умножения. Установите правильные отступы и проверьте, что всё напечатано без ошибок.

#numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]
#for number_1 in numbers:
#for number_2 in numbers:
#print(number_1, '*', number_2, '=', number_1 * number_2)











#numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]
#for number_1 in numbers:
#    for number_2 in numbers:
#        print(number_1, '*', number_2, '=', number_1 * number_2)

















#for number in range(1, 11):  # range(1, 11) — это числа от 1 до 10
#    print(number)
Как это работает:

number — это переменная, которая каждый раз принимает значение из диапазона range(1, 11).
Цикл повторяется 10 раз: от 1 до 10.
На каждом шаге команда print(number) выводит текущее значение переменной.








#count = 1  # Начинаем с 1
#while count <= 10:  # Пока count меньше или равно 10
#    print(count)
#    count += 1  # Увеличиваем count на 1
Как это работает:

Цикл начинается с числа count = 1.
Пока условие count <= 10 истинно, выполняется команда print(count).
После каждого прохода переменная count увеличивается на 1.
Когда count становится больше 10, цикл завершается.













#Команда break останавливает выполнение цикла, даже если условие ещё истинно.

#Пример:

#for number in range(1, 11):
#    if number == 5:  # Если число равно 5
#        break        # Цикл завершается
#    print(number)
Вывод:

1
2
3
4
Как только Python встречает break, цикл сразу заканчивается.















#Команда continue пропускает текущую итерацию цикла и переходит к следующей.

Пример:

#for number in range(1, 11):
#    if number == 5:  # Если число равно 5
#        continue     # Пропускаем эту итерацию
#    print(number)
Вывод:

1
2
3
4
6
7
8
9
10
Когда Python встречает continue, он пропускает оставшийся код в текущей итерации и сразу переходит к следующему числу.
















Зачем нужны циклы?

Они экономят время и делают код короче.
Позволяют работать с большими наборами данных, не повторяя одинаковые команды.
Помогают управлять повторяющимися действиями (например, обработкой списка или выполнения задачи несколько раз).
























Исключения (Exceptions) и обработка ошибок

Когда дело доходит до программирования, ошибки неизбежны. 
Однако способность правильно их обрабатывать может сделать наш код не только более надёжным,
но и более удобным для пользователя. В Python для обработки исключений используются конструкции try, except, а также finally и else.

Что такое исключение?
Исключение — это ошибка, которая возникает во время выполнения программы,
и если её не обработать, программа аварийно завершится.
Например, деление на ноль или попытка доступа к несуществующему элементу списка вызовут исключения.
Python предлагает множество встроенных исключений, которые помогают определить тип возникшей проблемы.

Вот некоторые из наиболее часто встречающихся исключений:

ValueError: Ошибка возникает, когда функция ожидает определенного типа или значения, но получает что-то неподходящее.
number = int("hello")  # Невозможно преобразовать строку в число


ZeroDivisionError: Попытка деления на ноль.
result = 10 / 0  # На ноль делить нельзя


FileNotFoundError: Попытка открыть несуществующий файл.
file = open("nonexistent_file.txt")  # Файл не найден


IndexError: Обращение к элементу списка за пределами его длины.
my_list = [1, 2, 3]
print(my_list[5])  # Индекс вне диапазона


TypeError: Попытка выполнить операцию с объектом неподходящего типа.
result = "text" + 5  # Нельзя складывать строку и число